Zektopic/ESP32-CAM_MJPEG2SD/motionDetect.cpp

/* 
 Detect movement in sequential images using background subtraction.
 
 Very small (96x96) bitmaps are used both to provide image smoothing to reduce spurious motion changes 
 and to enable rapid processing
 Bitmaps can either be color or grayscale. Color requires triple memory
 of grayscale and more processing.

 The amount of change between images will depend on the frame rate.
 A faster frame rate will need a higher sensitivity

 When frame size is changed the OV2640 outputs a few glitched frames whilst it 
 makes the transition. These could be interpreted as spurious motion.

 Machine Learning can be incorporated to further discriminate when motion detection 
 has occurred by classsifying whether the object in the frame is of a particular
 type of interest, eg a human, animal, vehicle etc. 
 
 s60sc 2020, 2023, 2025
*/

#include "appGlobals.h"

#if INCLUDE_TINYML
#include TINY_ML_LIB
#endif

#define RESIZE_DIM 96  // dimensions of resized motion bitmap
#define RESIZE_DIM_SQ (RESIZE_DIM * RESIZE_DIM) // pixels in bitmap
#define INACTIVE_COLOR 96 // color for inactive motion pixel
#define JPEG_QUAL 80 // % quality for generated motion detect jpeg
  
// motion recording parameters
bool dbgMotion = false;
int detectMotionFrames = 5; // min sequence of changed frames to confirm motion 
int detectNightFrames = 10; // frames of sequential darkness to avoid spurious day / night switching
// define region of interest, ie exclude top and bottom of image from movement detection if required
// divide image into detectNumBands horizontal bands, define start and end bands of interest, 1 = top
int detectNumBands = 10;
int detectStartBand = 3;
int detectEndBand = 8; // inclusive
int detectChangeThreshold = 15; // min difference in pixel comparison to indicate a change
uint8_t colorDepth; // set by depthColor config
static size_t stride;
bool mlUse = false; // whether to use ML for motion detection, requires INCLUDE_TINYML to be true
float mlProbability = 0.8; // minimum probability (0.0 - 1.0) for positive classification

uint8_t lightLevel; // Current ambient light level 
uint8_t nightSwitch = 20; // initial white level % for night/day switching
float motionVal = 8.0; // initial motion sensitivity setting
uint8_t* motionJpeg = NULL;
size_t motionJpegLen = 0;
static uint8_t* currBuff = NULL;

#ifndef AUXILIARY

#if INCLUDE_NEW_JPG
// use esp_new_jpeg library instead of built in
#include <esp_jpeg_dec.h>
#include <esp_jpeg_enc.h>

struct esp_jpeg_stream {
    jpeg_dec_handle_t       jpeg_dec;
    jpeg_dec_io_t*          jpeg_io;
    jpeg_dec_header_info_t* out_info;
    jpeg_pixel_format_t     output_type;
};
typedef struct esp_jpeg_stream* esp_jpeg_stream_handle_t;

static void jpgReduce(int inWidth, int inHeight, uint8_t downsize, int* outWidth, int* outHeight);
static bool jpg2rgbOpen(esp_jpeg_stream_handle_t jpegHandle, uint16_t width, uint16_t height);
static bool jpg2rgb(esp_jpeg_stream_handle_t jpegHandle, uint8_t* inputBuf, int inputLen, uint8_t* outputBuf);
static bool jpg2rgbClose(esp_jpeg_stream_handle_t jpegHandle);
static size_t rgb2jpg(uint8_t* rgb888, int width, int height, int qual, uint8_t* outputBuf);
#else
// built in
static bool jpg2rgb(const uint8_t* src, size_t src_len, uint8_t* out, uint8_t scale);
#endif

/**********************************************************************************/


bool isNight(uint8_t nightSwitch) {
  // check if night time for suspending recording
  // or for switching relay if enabled
  static bool nightTime = false;
  static uint16_t nightCnt = 0;
  if (nightTime) {
    if (lightLevel > nightSwitch) {
      // light image
      nightCnt--;
      // signal day time after given sequence of light frames
      if (nightCnt == 0) {
        nightTime = false;
        LOG_INF("Day time");
      }
    }
  } else {
    if (lightLevel < nightSwitch) {
      // dark image
      nightCnt++;
      // signal night time after given sequence of dark frames
      if (nightCnt > detectNightFrames) {
        nightTime = true;     
        LOG_INF("Night time"); 
      }
    }
  } 
  return nightTime;
}

static void rescaleImage(const uint8_t* input, int inputWidth, int inputHeight, uint8_t* output, int outputWidth, int outputHeight) {
  // use fixed-point integer math for bilinear interpolation to avoid slow floating point operations
  uint32_t xRatio = ((uint32_t)inputWidth << 16) / outputWidth;
  uint32_t yRatio = ((uint32_t)inputHeight << 16) / outputHeight;
  uint8_t* outPtr = output;

  for (int i = 0; i < outputHeight; ++i) {
    uint32_t y = i * yRatio;
    int yL = y >> 16;
    int yH = yL + 1;
    if (yH >= inputHeight) yH = inputHeight - 1;
    uint32_t yWeight = y & 0xFFFF;
    uint32_t yWeightInv = 65536 - yWeight;

    int yL_offset = yL * inputWidth * colorDepth;
    int yH_offset = yH * inputWidth * colorDepth;

    for (int j = 0; j < outputWidth; ++j) {
      uint32_t x = j * xRatio;
      int xL = x >> 16;
      int xH = xL + 1;
      if (xH >= inputWidth) xH = inputWidth - 1;
      uint32_t xWeight = x & 0xFFFF;
      uint32_t xWeightInv = 65536 - xWeight;

      int xL_offset = xL * colorDepth;
      int xH_offset = xH * colorDepth;

      int idxA = yL_offset + xL_offset;
      int idxB = yL_offset + xH_offset;
      int idxC = yH_offset + xL_offset;
      int idxD = yH_offset + xH_offset;

      if (colorDepth == 3) {
        // RGB
        uint8_t a0 = input[idxA++]; uint8_t b0 = input[idxB++]; uint8_t c0 = input[idxC++]; uint8_t d0 = input[idxD++];
        uint8_t a1 = input[idxA++]; uint8_t b1 = input[idxB++]; uint8_t c1 = input[idxC++]; uint8_t d1 = input[idxD++];
        uint8_t a2 = input[idxA++]; uint8_t b2 = input[idxB++]; uint8_t c2 = input[idxC++]; uint8_t d2 = input[idxD++];

        uint32_t top0 = (a0 * xWeightInv + b0 * xWeight) >> 16;
        uint32_t bottom0 = (c0 * xWeightInv + d0 * xWeight) >> 16;
        *outPtr++ = (uint8_t)((top0 * yWeightInv + bottom0 * yWeight) >> 16);

